app/Controllers/Home.php

SELECT *
FROM `posts`
ORDER BY `id` DESC
---
    public function index()
    {
        $postModel = new PostModel();

        $dados = [
            'posts' => $postModel->orderBy('id', 'desc')->findAll()
        ];