app/Controllers/Post.php

    public function edit($id){
        $postModel = new PostModel();
        $post = $postModel->find($id);
---
SELECT *
FROM `posts`
WHERE `posts`.`id` = '6'

    public function excluir($id){
        $postModel = new PostModel();

        if($postModel->delete($id)){
---
DELETE FROM `posts`
WHERE `id` IN ('9')